# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 7  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, repeats, module, args]
  [[-1, 1, HGStem, [32, 64]],  # 0-P2/4
   [-1, 6, Light_HGBlock, [64, 128, 3]],  # stage 1

   [-1, 1, DWConv, [128, 3, 2, 1, False]],  # 2-P3/8
   [-1, 6, Light_HGBlock, [128, 512, 3]],
   [-1, 6, Light_HGBlock, [128, 512, 3, 3, True]],   # 4-stage 2

   [-1, 1, DWConv, [512, 3, 2, 1, False]],  # 5-P3/16
   [-1, 6, Light_HGBlock, [256, 1024, 5, 3, False]],  # cm, c2, k, light, shortcut
   [-1, 6, Light_HGBlock, [192, 1024, 5, 3, True]],
   [-1, 6, Light_HGBlock, [192, 1024, 5, 3, True]],
   [-1, 6, Light_HGBlock, [192, 1024, 5, 3, True]],
   [-1, 6, Light_HGBlock, [192, 1024, 5, 3, True]],  # 10-stage 3

   [-1, 1, DWConv, [1024, 3, 2, 1, False]],  # 11-P4/32
   [-1, 6, Light_HGBlock, [512, 2048, 5, 3, False]],
   [-1, 6, Light_HGBlock, [512, 2048, 5, 3, True]],  # 13-stage 4
   [-1, 1, SPPF, [1024, 5]],   # 14
  ]


# YOLOv5.0n head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 10], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 18

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 22 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 25 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 28 (P5/32-large)

   [[22, 25, 28], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]